{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\IMPORTANCE ABOUT ME !\Lanjut Sekolah\Universitas Indonesia\Semester 1\Ekonometrika\Assist_Assignment_IAD\Logfile_Econometrics_Assignment_2406461242.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}10 Dec 2024, 13:59:48
{txt}
{com}. 
. cd "D:\IMPORTANCE ABOUT ME !\Lanjut Sekolah\Universitas Indonesia\Semester 1\Ekonometrika\Assist_Assignment_IAD"
{res}D:\IMPORTANCE ABOUT ME !\Lanjut Sekolah\Universitas Indonesia\Semester 1\Ekonometrika\Assist_Assignment_IAD
{txt}
{com}. 
. global ASSIGN "D:\IMPORTANCE ABOUT ME !\Lanjut Sekolah\Universitas Indonesia\Semester 1\Ekonometrika\Assist_Assignment_IAD"
{txt}
{com}. 
. 
. /////*****INCOME*****/////
> *** Since, income and tenure are in the same data file, it is possible to clean the data at the same time. Refers to its paper, it indicates that tenure needs to be square. It needs to be checked the duplication. I use the hhid14_9 as every data has the latest hhid.
. use "D:\IMPORTANCE ABOUT ME !\Lanjut Sekolah\Universitas Indonesia\Semester 1\Ekonometrika\Assist_Assignment_IAD\data\b3a_tk2.dta"
{txt}
{com}. 
. gen Income = tk25a1
{txt}(11,970 missing values generated)

{com}. label variable Income "Monthly Income at The Last Job"
{txt}
{com}. drop if missing(Income)
{txt}(11,970 observations deleted)

{com}. 
. /////*****TENURE*****/////
> gen Tenure = tk23a2y
{txt}(24 missing values generated)

{com}. label variable Tenure "Time Spent for The Primary Job in Years"
{txt}
{com}. drop if missing(Tenure)
{txt}(24 observations deleted)

{com}. 
. gen Tenure2 = Tenure * Tenure
{txt}
{com}. label variable Tenure2 "Tenure Squared"
{txt}
{com}. keep hhid14_9 pid14 Income Tenure Tenure2
{txt}
{com}. 
. duplicates report hhid14_9

{p 0 4}{txt}Duplicates in terms of {res} hhid14_9{p_end}

{txt}{hline 10}{c TT}{hline 27}
   Copies {c |} Observations       Surplus
{hline 10}{c +}{hline 27}
        1 {c |}         {res}5845             0
        {txt}2 {c |}         {res}4810          2405
        {txt}3 {c |}         {res}1269           846
        {txt}4 {c |}          {res}424           318
        {txt}5 {c |}          {res}105            84
        {txt}6 {c |}           {res}42            35
{txt}{hline 10}{c BT}{hline 27}

{com}. duplicates drop hhid14_9, force

{p 0 4}{txt}Duplicates in terms of {res} hhid14_9{p_end}

{txt}(3,688 observations deleted)

{com}. 
. save assign_data, replace
{txt}{p 0 4 2}
file {bf}
assign_data.dta{rm}
saved
{p_end}

{com}. 
. 
. /////*****SCHYRS*****/////
> ***Merge with b3a_dl1, keep the observations available in the both sides, delete the unnecessary observations, and well-defined the educational levels.
. merge 1:m hhid14_9 using "D:\IMPORTANCE ABOUT ME !\Lanjut Sekolah\Universitas Indonesia\Semester 1\Ekonometrika\Assist_Assignment_IAD\data\b3a_dl1.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          12,225
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}          12,225{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          22,239{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. keep if _merge == 3
{txt}(12,225 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. drop if inlist(dl06, 17, 90, 95, 98, 99)
{txt}(29 observations deleted)

{com}. drop if inlist(dl07, 98, 99) | missing(dl07) & dl06!=14
{txt}(884 observations deleted)

{com}. 
. gen Schyrs = 0
{txt}
{com}. 
. * 1. SD (max 6 yrs)
. replace Schyrs = 6 if inlist(dl06, 2, 11, 72) & dl07 >= 6
{txt}(3,117 real changes made)

{com}. replace Schyrs = 5 if inlist(dl06, 2, 11, 72) & dl07 == 5
{txt}(467 real changes made)

{com}. replace Schyrs = 4 if inlist(dl06, 2, 11, 72) & dl07 == 4
{txt}(569 real changes made)

{com}. replace Schyrs = 3 if inlist(dl06, 2, 11, 72) & dl07 == 3
{txt}(595 real changes made)

{com}. replace Schyrs = 2 if inlist(dl06, 2, 11, 72) & dl07 == 2
{txt}(575 real changes made)

{com}. replace Schyrs = 1 if inlist(dl06, 2, 11, 72) & dl07 == 1
{txt}(434 real changes made)

{com}. replace Schyrs = 0 if inlist(dl06, 2, 11, 72) & dl07 == 0
{txt}(0 real changes made)

{com}. 
. * 2. SMP (max 3 yrs)
. replace Schyrs = 9 if inlist(dl06, 3, 4, 12, 73) & dl07 >= 3
{txt}(2,887 real changes made)

{com}. replace Schyrs = 8 if inlist(dl06, 3, 4, 12, 73) & dl07 == 2
{txt}(589 real changes made)

{com}. replace Schyrs = 7 if inlist(dl06, 3, 4, 12, 73) & dl07 == 1
{txt}(483 real changes made)

{com}. replace Schyrs = 6 if inlist(dl06, 3, 4, 12, 73) & dl07 == 0
{txt}(227 real changes made)

{com}. 
. * 3. SMA (max 3 yrs)
. replace Schyrs = 12 if inlist(dl06, 5, 6, 14, 15, 74) & dl07 >= 3
{txt}(6,010 real changes made)

{com}. replace Schyrs = 11 if inlist(dl06, 5, 6, 14, 15, 74) & dl07 == 2
{txt}(537 real changes made)

{com}. replace Schyrs = 10 if inlist(dl06, 5, 6, 14, 15, 74) & dl07 == 1
{txt}(565 real changes made)

{com}. replace Schyrs = 9 if inlist(dl06, 5, 6, 14, 15, 74) & dl07 == 0
{txt}(519 real changes made)

{com}. 
. * 4. Diploma (max 3 yrs)
. replace Schyrs = 15 if dl06 == 60 & dl07 >= 3
{txt}(724 real changes made)

{com}. replace Schyrs = 14 if dl06 == 60 & dl07 == 2
{txt}(40 real changes made)

{com}. replace Schyrs = 13 if dl06 == 60 & dl07 == 1
{txt}(41 real changes made)

{com}. replace Schyrs = 12 if dl06 == 60 & dl07 == 0
{txt}(58 real changes made)

{com}. 
. * 5. S1 or Open University (max 4 yrs)
. replace Schyrs = 16 if inlist(dl06, 13, 61) & dl07 >= 4
{txt}(1,835 real changes made)

{com}. replace Schyrs = 15 if inlist(dl06, 13, 61) & dl07 == 3
{txt}(158 real changes made)

{com}. replace Schyrs = 14 if inlist(dl06, 13, 61) & dl07 == 2
{txt}(140 real changes made)

{com}. replace Schyrs = 13 if inlist(dl06, 13, 61) & dl07 == 1
{txt}(167 real changes made)

{com}. replace Schyrs = 12 if inlist(dl06, 13, 61) & dl07 == 0
{txt}(141 real changes made)

{com}. 
. * 6. S2 (max 2 yrs)
. replace Schyrs = 18 if dl06 == 62 & dl07 >= 2
{txt}(143 real changes made)

{com}. replace Schyrs = 17 if dl06 == 62 & dl07 == 1
{txt}(22 real changes made)

{com}. 
. * 7. S3 (max 5 yrs)
. replace Schyrs = 23 if dl06 == 63 & dl07 >= 5
{txt}(4 real changes made)

{com}. replace Schyrs = 22 if dl06 == 63 & dl07 == 4
{txt}(1 real change made)

{com}. replace Schyrs = 21 if dl06 == 63 & dl07 == 3
{txt}(0 real changes made)

{com}. replace Schyrs = 20 if dl06 == 63 & dl07 == 2
{txt}(0 real changes made)

{com}. replace Schyrs = 19 if dl06 == 63 & dl07 == 1
{txt}(1 real change made)

{com}. replace Schyrs = 18 if dl06 == 63 & dl07 == 0
{txt}(3 real changes made)

{com}. 
. 
. label variable Schyrs "Years of Schooling"
{txt}
{com}. keep hhid14_9 pid14 pidlink Income Tenure Tenure2 Schyrs
{txt}
{com}. duplicates report hhid14_9 pid14

{p 0 4}{txt}Duplicates in terms of {res} hhid14_9 pid14{p_end}

{txt}{hline 10}{c TT}{hline 27}
   Copies {c |} Observations       Surplus
{hline 10}{c +}{hline 27}
        1 {c |}         {res}1340             0
        {txt}2 {c |}         {res}8718          4359
        {txt}3 {c |}         {res}4974          3316
        {txt}4 {c |}         {res}3536          2652
        {txt}5 {c |}         {res}1585          1268
        {txt}6 {c |}          {res}738           615
        {txt}7 {c |}          {res}273           234
        {txt}8 {c |}           {res}80            70
        {txt}9 {c |}           {res}72            64
       {txt}10 {c |}           {res}10             9
{txt}{hline 10}{c BT}{hline 27}

{com}. duplicates drop hhid14_9 pid14, force

{p 0 4}{txt}Duplicates in terms of {res} hhid14_9 pid14{p_end}

{txt}(12,587 observations deleted)

{com}. 
. save assign_data, replace
{txt}{p 0 4 2}
file {bf}
assign_data.dta{rm}
saved
{p_end}

{com}. 
. /////*****AGE*****/////
> ***Since age, month of birth and gender are in the same dataset, it can be merged directly with bk_ar1. Drop the observations that didn't answer or unknown.
. merge 1:m hhid14_9 using "D:\IMPORTANCE ABOUT ME !\Lanjut Sekolah\Universitas Indonesia\Semester 1\Ekonometrika\Assist_Assignment_IAD\data\bk_ar1.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          40,001
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}          40,001{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          49,381{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. keep if _merge == 3
{txt}(40,001 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. gen Age = ar09
{txt}(3,410 missing values generated)

{com}. label variable Age "Individual Age in Years"
{txt}
{com}. drop if Age == 0 | Age == 998
{txt}(804 observations deleted)

{com}. 
. gen Age2 = Age * Age
{txt}(3,410 missing values generated)

{com}. label variable Age2 "Age Squared"
{txt}
{com}. 
. /////*****GENDER, specifically for female*****/////
> gen Female = (ar07 == 3)
{txt}
{com}. label variable Female "Gender (1=Female, 0=Male)"
{txt}
{com}. 
. 
. /////*****BIRTH-MONTH*****/////
> gen BirthMonth = ar08mth
{txt}(3,410 missing values generated)

{com}. label variable BirthMonth "Month of Birth"
{txt}
{com}. drop if BirthMonth == 98
{txt}(595 observations deleted)

{com}. 
. keep hhid14_9 pid14 pidlink Income Tenure Tenure2 Schyrs Female Age Age2 BirthMonth
{txt}
{com}. 
. 
. /////*****URBAN*****/////
> merge m:1 hhid14_9 using "D:\IMPORTANCE ABOUT ME !\Lanjut Sekolah\Universitas Indonesia\Semester 1\Ekonometrika\Assist_Assignment_IAD\data\bk_sc1.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}           7,182
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}           7,182{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          47,982{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. keep if _merge == 3
{txt}(7,182 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. drop if missing(sc05)
{txt}(0 observations deleted)

{com}. gen Urban = sc05
{txt}
{com}. replace Urban = 0 if sc05 == 1
{txt}(31,720 real changes made)

{com}. replace Urban = 1 if sc05 == 2
{txt}(16,262 real changes made)

{com}. 
. label define Urban 1 "Urban" 0 "Non-Urban"
{txt}
{com}. label values Urban Urban
{txt}
{com}. label variable Urban "Urban or Rural"
{txt}
{com}. 
. keep hhid14_9 pid14 pidlink Income Tenure Tenure2 Schyrs Female Age Age2 BirthMonth Urban
{txt}
{com}. 
. duplicates report hhid14_9

{p 0 4}{txt}Duplicates in terms of {res} hhid14_9{p_end}

{txt}{hline 10}{c TT}{hline 27}
   Copies {c |} Observations       Surplus
{hline 10}{c +}{hline 27}
        1 {c |}          {res}573             0
        {txt}2 {c |}         {res}1154           577
        {txt}3 {c |}         {res}4071          2714
        {txt}4 {c |}         {res}6120          4590
        {txt}5 {c |}         {res}5765          4612
        {txt}6 {c |}         {res}5556          4630
        {txt}7 {c |}         {res}4907          4206
        {txt}8 {c |}         {res}4192          3668
        {txt}9 {c |}         {res}3717          3304
       {txt}10 {c |}         {res}3060          2754
       {txt}11 {c |}         {res}2156          1960
       {txt}12 {c |}         {res}2112          1936
       {txt}13 {c |}         {res}1287          1188
       {txt}14 {c |}          {res}882           819
       {txt}15 {c |}          {res}750           700
       {txt}16 {c |}          {res}608           570
       {txt}17 {c |}          {res}391           368
       {txt}18 {c |}          {res}216           204
       {txt}19 {c |}          {res}171           162
       {txt}20 {c |}           {res}40            38
       {txt}21 {c |}          {res}126           120
       {txt}22 {c |}           {res}66            63
       {txt}23 {c |}           {res}23            22
       {txt}39 {c |}           {res}39            38
{txt}{hline 10}{c BT}{hline 27}

{com}. duplicates drop hhid14_9, force

{p 0 4}{txt}Duplicates in terms of {res} hhid14_9{p_end}

{txt}(39,243 observations deleted)

{com}. 
. save assign_data, replace
{txt}{p 0 4 2}
file {bf}
assign_data.dta{rm}
saved
{p_end}

{com}. 
. 
. /////*****REGRESSION*****/////
> ***It can be easily compared when putting these two results on the same table together. 
. reg Income Schyrs Age Age2 Tenure Tenure2 Urban Female

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     8,308
{txt}{hline 13}{c +}{hline 34}   F(7, 8300)      = {res}     7.66
{txt}       Model {c |} {res} 1.3166e+16         7  1.8808e+15   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.0370e+18     8,300  2.4542e+14   {txt}R-squared       ={res}    0.0064
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0056
{txt}       Total {c |} {res} 2.0501e+18     8,307  2.4680e+14   {txt}Root MSE        =   {res} 1.6e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      Income{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}Schyrs {c |}{col 14}{res}{space 2} 234962.7{col 26}{space 2} 43837.09{col 37}{space 1}    5.36{col 46}{space 3}0.000{col 54}{space 4} 149031.1{col 67}{space 3} 320894.4
{txt}{space 9}Age {c |}{col 14}{res}{space 2} 32781.29{col 26}{space 2} 31501.43{col 37}{space 1}    1.04{col 46}{space 3}0.298{col 54}{space 4}-28969.38{col 67}{space 3} 94531.96
{txt}{space 8}Age2 {c |}{col 14}{res}{space 2}-347.6658{col 26}{space 2} 458.1479{col 37}{space 1}   -0.76{col 46}{space 3}0.448{col 54}{space 4} -1245.75{col 67}{space 3} 550.4185
{txt}{space 6}Tenure {c |}{col 14}{res}{space 2} 160768.5{col 26}{space 2} 50077.53{col 37}{space 1}    3.21{col 46}{space 3}0.001{col 54}{space 4} 62604.02{col 67}{space 3}   258933
{txt}{space 5}Tenure2 {c |}{col 14}{res}{space 2}-3606.023{col 26}{space 2} 1523.689{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-6592.834{col 67}{space 3}-619.2128
{txt}{space 7}Urban {c |}{col 14}{res}{space 2}-603672.5{col 26}{space 2} 373828.6{col 37}{space 1}   -1.61{col 46}{space 3}0.106{col 54}{space 4} -1336470{col 67}{space 3}   129125
{txt}{space 6}Female {c |}{col 14}{res}{space 2}-37478.46{col 26}{space 2} 344122.4{col 37}{space 1}   -0.11{col 46}{space 3}0.913{col 54}{space 4}-712044.3{col 67}{space 3} 637087.4
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -1213935{col 26}{space 2} 729364.2{col 37}{space 1}   -1.66{col 46}{space 3}0.096{col 54}{space 4} -2643671{col 67}{space 3} 215801.2
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo ols
{txt}
{com}. ivregress 2sls Income (Schyrs = BirthMonth) Age Age2 Tenure Tenure2 Urban Female
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}     8,308
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}     14.13
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0489
{txt}{col 1}{col 51}R-squared{col 67}= {res}         .
{txt}{col 51}Root MSE{col 67}=    {res} 2.1e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      Income{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      z{col 46}   P>|z|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}Schyrs {c |}{col 14}{res}{space 2}  3763172{col 26}{space 2} 1.06e+07{col 37}{space 1}    0.35{col 46}{space 3}0.724{col 54}{space 4}-1.71e+07{col 67}{space 3} 2.46e+07
{txt}{space 9}Age {c |}{col 14}{res}{space 2} 32373.88{col 26}{space 2} 42031.22{col 37}{space 1}    0.77{col 46}{space 3}0.441{col 54}{space 4}-50005.79{col 67}{space 3} 114753.6
{txt}{space 8}Age2 {c |}{col 14}{res}{space 2}  441.263{col 26}{space 2} 2456.423{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4}-4373.237{col 67}{space 3} 5255.763
{txt}{space 6}Tenure {c |}{col 14}{res}{space 2}-192487.9{col 26}{space 2}  1067425{col 37}{space 1}   -0.18{col 46}{space 3}0.857{col 54}{space 4} -2284603{col 67}{space 3}  1899627
{txt}{space 5}Tenure2 {c |}{col 14}{res}{space 2} 7843.111{col 26}{space 2} 34587.49{col 37}{space 1}    0.23{col 46}{space 3}0.821{col 54}{space 4}-59947.13{col 67}{space 3} 75633.35
{txt}{space 7}Urban {c |}{col 14}{res}{space 2}  5468050{col 26}{space 2} 1.83e+07{col 37}{space 1}    0.30{col 46}{space 3}0.765{col 54}{space 4}-3.04e+07{col 67}{space 3} 4.14e+07
{txt}{space 6}Female {c |}{col 14}{res}{space 2} 369934.1{col 26}{space 2}  1311576{col 37}{space 1}    0.28{col 46}{space 3}0.778{col 54}{space 4} -2200708{col 67}{space 3}  2940576
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-3.76e+07{col 26}{space 2} 1.10e+08{col 37}{space 1}   -0.34{col 46}{space 3}0.732{col 54}{space 4}-2.53e+08{col 67}{space 3} 1.78e+08
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 12 17}Endogenous: {res:Schyrs}{p_end}
{p 0 12 17}Exogenous:{space 1} {res:Age Age2 Tenure Tenure2 Urban Female BirthMonth}{p_end}

{com}. eststo IV
{txt}
{com}. esttab ols IV using "Result.doc", b(4) se(4) mtitle("OLS" "IV") r2 title("Table 1. Regression Results")
{res}{txt}(output written to {browse  `"Result.doc"'})

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\IMPORTANCE ABOUT ME !\Lanjut Sekolah\Universitas Indonesia\Semester 1\Ekonometrika\Assist_Assignment_IAD\Logfile_Econometrics_Assignment_2406461242.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}10 Dec 2024, 13:59:49
{txt}{.-}
{smcl}
{txt}{sf}{ul off}